## Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.
my_list = [17, None, -30, 'Text', True, 19.5]
# Переменные variables
str_var = 'Строка'
int_var = 17  # integer целое число.
float_var = 19.5  # float плавающие.
list_var = [7, 5, 'text']
dict_var = {1: 'a', 2: 'b', 3: 'c'}  # Словарь.

for el in list:
    print(type(el))
    



    




