"""
1. Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление.
Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.
"""
def devision (arg_1,arg_2):
    arg_1 = int(input('Введите первое число'))
    arg_1 = int(input('Введите первое число'))
    res = arg_1 / arg_2  
    print(res)
    return
        
       
 